app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.all
---
SELECT * FROM "pictures"

  def show
    @picture = Picture.find(params[:id])
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 1)

  def create
    @picture = Picture.new(params[:picture])
    if @picture.save
---
INSERT INTO "pictures" ("gallery_id", "updated_at", "caption", "filename", "created_at") VALUES(1, '2009-08-04 17:27:38', 'This is a caption', 'picture1.jpg', '2009-08-04 17:27:38')